src/Catalogs/Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Тарифы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АвтомобилиТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГаражныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Тарифы/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)//Островская Татьяна 15.04.2014 № 17268
	Автомобиль = "";
	Для каждого СтрокаТЧ Из АвтомобилиТЧ Цикл
		
		Значение = ПроцедурыУправленияПерсоналом.УдалениеСимволовСкобок(СтрокаТЧ.Наименование.Наименование)+
		?(ЗначениеЗаполнено(СтрокаТЧ.Наименование.ГаражныйНомер),", "+СтрокаТЧ.Наименование.ГаражныйНомер,"");
		
		Если СтрДлина(Автомобиль) < 100 Тогда
			Автомобиль = Автомобиль + ", " + Значение;
		Иначе
			Автомобиль = Сред(Автомобиль,3,95) + "...";
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	Если Лев(Автомобиль,2) = ", " Тогда
		ДлинаСтроки = СтрДлина(Автомобиль);
		Если ДлинаСтроки < 100 Тогда
			Автомобиль = Сред(Автомобиль,3)
		Иначе
			Автомобиль = Сред(Автомобиль,3,95) + "...";
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры
